GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
  const float fps =
      static_cast<float>(g_presented_frame_count) * 1000.0f /
      static_cast<float>(now - g_presented_fps_ms);
  char message[64];
  snprintf(message, sizeof(message), camera_text().camera_fps_fmt, fps);
  set_status(message);
  if (g_present_timed_frames > 0) {
    Serial.printf(
        "[CameraStream] Present: %.1f FPS wait=%.1fms ppa+cache+swap=%.1fms\n",
        fps,
        static_cast<double>(g_present_wait_total_us) /
            static_cast<double>(g_present_timed_frames) / 1000.0,
        static_cast<double>(g_present_copy_total_us) /
            static_cast<double>(g_present_timed_frames) / 1000.0);
  }
  g_presented_frame_count = 0;
  g_presented_fps_ms = now;
  g_present_wait_total_us = 0;
  g_present_copy_total_us = 0;
  g_present_timed_frames = 0;
}

static bool ensure_jpeg_decoder() {
  if (g_jpeg_decoder) return true;

  jpeg_decode_engine_cfg_t engine_config{};
  engine_config.intr_priority = 0;
  engine_config.timeout_ms = 500;
  const esp_err_t result =
      jpeg_new_decoder_engine(&engine_config, &g_jpeg_decoder);
  if (result != ESP_OK || !g_jpeg_decoder) {
    g_jpeg_decoder = nullptr;
    Serial.printf("[CameraStream] JPEG-Engine konnte nicht starten: %s\n",
                  esp_err_to_name(result));
    set_status(camera_text().camera_decoder_start_failed, true);
    return false;
  }
  Serial.println("[CameraStream] JPEG-Hardwaredecoder bereit");
  return true;
}

static uint16_t rgb888_to_swapped_rgb565(uint32_t rgb) {
  const uint16_t native = static_cast<uint16_t>(
      (((rgb >> 16U) & 0xFFU) >> 3U) << 11U |
      (((rgb >> 8U) & 0xFFU) >> 2U) << 5U |
      ((rgb & 0xFFU) >> 3U));
  return static_cast<uint16_t>((native << 8U) | (native >> 8U));
}

static void apply_rounded_frame_corners(uint16_t* pixels) {
  if (!pixels || kCornerRadius == 0 ||
      kCornerRadius * 2U > kWidth || kCornerRadius * 2U > kHeight) {
    return;
  }

  // LVGL's generic rounded child clipping blends the entire 752x424 image.
  // Masking only these four tiny corner quadrants preserves the same solid
  // popup surface while keeping the regular cache-coherent LVGL render path.
  const int32_t diameter = static_cast<int32_t>(kCornerRadius) * 2;
  const int32_t radius_squared = diameter * diameter;
  for (uint16_t y = 0; y < kCornerRadius; ++y) {
    const int32_t dy = diameter - 1 - static_cast<int32_t>(y) * 2;
    uint16_t* top = pixels + static_cast<size_t>(y) * kDecodedWidth;
    uint16_t* bottom =
        pixels + static_cast<size_t>(kHeight - 1U - y) * kDecodedWidth;
    for (uint16_t x = 0; x < kCornerRadius; ++x) {
      const int32_t dx = diameter - 1 - static_cast<int32_t>(x) * 2;
      if ((dx * dx) + (dy * dy) <= radius_squared) continue;
      top[x] = g_corner_fill_swapped;
      top[kWidth - 1U - x] = g_corner_fill_swapped;
      bottom[x] = g_corner_fill_swapped;
      bottom[kWidth - 1U - x] = g_corner_fill_swapped;
    }
  }
}

static bool decode_jpeg_frame(const uint8_t* jpeg, size_t jpeg_bytes) {
  if (!jpeg || jpeg_bytes < 4 || jpeg_bytes > UINT32_MAX ||
      jpeg[0] != 0xFF || jpeg[1] != 0xD8 ||
      jpeg[jpeg_bytes - 2] != 0xFF || jpeg[jpeg_bytes - 1] != 0xD9) {
    Serial.printf("[CameraStream] Ungueltiger JPEG-Frame: %u Bytes\n",
                  static_cast<unsigned>(jpeg_bytes));
    set_status(camera_text().camera_invalid_response, true);
    return false;
  }

  jpeg_decode_picture_info_t picture_info{};
  esp_err_t result = jpeg_decoder_get_info(
      jpeg, static_cast<uint32_t>(jpeg_bytes), &picture_info);
  if (result != ESP_OK ||
      picture_info.width != kWidth || picture_info.height != kHeight) {
    Serial.printf(
        "[CameraStream] JPEG-Format ungueltig: decode=%s size=%ux%u\n",
        esp_err_to_name(result),
        static_cast<unsigned>(picture_info.width),
        static_cast<unsigned>(picture_info.height));
    set_status(camera_text().camera_invalid_response, true);
    return false;
  }

  if (!ensure_jpeg_decoder()) return false;
  const int8_t index = acquire_write_buffer();
  if (index < 0) return true;

  jpeg_decode_cfg_t decode_config{};
  decode_config.output_format = JPEG_DECODE_OUT_FORMAT_RGB565;
  // RGB order produces the byte layout represented by
  // LV_COLOR_FORMAT_RGB565_SWAPPED on the little-endian P4.
  decode_config.rgb_order = JPEG_DEC_RGB_ELEMENT_ORDER_RGB;
  decode_config.conv_std = JPEG_YUV_RGB_CONV_STD_BT601;

  const uint32_t decode_started_ms = millis();
  uint32_t decoded_bytes = 0;
  {
    // JPEG and display PPA share the P4's 2D-DMA pool. Skipping a frame on
    // timeout is safe; decoding concurrently is not.
    Dma2dArbiterGuard dma2d_guard(500);
    if (!dma2d_guard.locked()) {
      release_write_buffer(index);
      Serial.println("[CameraStream] JPEG ausgelassen: 2D-DMA belegt");
      return true;
    }
    result = jpeg_decoder_process(
        g_jpeg_decoder,
        &decode_config,
        jpeg,
        static_cast<uint32_t>(jpeg_bytes),
        reinterpret_cast<uint8_t*>(g_pixels[index]),
        static_cast<uint32_t>(kPixelBytes),
        &decoded_bytes);
    if (result != ESP_OK || decoded_bytes < kPixelBytes) {
      // Discard a potentially wedged decoder while the DMA arbiter is still
      // held. The next popup/frame creates a clean engine.
      jpeg_del_decoder_engine(g_jpeg_decoder);
      g_jpeg_decoder = nullptr;
    }
  }

  if (result != ESP_OK || decoded_bytes < kPixelBytes) {
    release_write_buffer(index);
    Serial.printf(
        "[CameraStream] JPEG-Decode fehlgeschlagen: %s bytes=%u/%u\n",
        esp_err_to_name(result),
        static_cast<unsigned>(decoded_bytes),
        static_cast<unsigned>(kPixelBytes));
    set_status(camera_text().camera_decoder_error, true);
    return false;
  }

  apply_rounded_frame_corners(g_pixels[index]);
  publish_write_buffer(index);
  ++g_worker_frame_count;
  if (g_worker_frame_count == 1) {
    Serial.printf(
        "[CameraStream] Erstes Bild dekodiert: jpeg=%u Bytes decode=%ums "
        "int=%uKB largest=%uKB psram=%uKB\n",
        static_cast<unsigned>(jpeg_bytes),
        static_cast<unsigned>(millis() - decode_started_ms),
        static_cast<unsigned>(
            heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U),
        static_cast<unsigned>(
            heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL) / 1024U),
        static_cast<unsigned>(
            heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U));
    set_status(camera_text().camera_ready);
  }
  return true;
}

// Receives the HomeTiles record stream after HttpChunkedBodyDecoder has
// removed HTTP/1.1 chunk framing. Each record is a big-endian uint32 length
// followed by exactly one complete JPEG frame.
class JpegRecordStream final : public Stream {
 public:
  explicit JpegRecordStream(uint8_t* input)
      : input_(input),
        last_fps_ms_(millis()) {}

