GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
  size_t write(uint8_t value) override {
    return write(&value, 1);
  }

  size_t write(const uint8_t* data, size_t len) override {
    if (!data || len == 0) return 0;
    if (g_stop_requested || failed_) return 0;
    const size_t accepted = len;

    while (len > 0 && !failed_ && !g_stop_requested) {
      if (length_bytes_ < sizeof(length_header_)) {
        const size_t take =
            std::min(len, sizeof(length_header_) - length_bytes_);
        memcpy(length_header_ + length_bytes_, data, take);
        length_bytes_ += take;
        data += take;
        len -= take;
        if (length_bytes_ < sizeof(length_header_)) continue;

        expected_bytes_ =
            (static_cast<size_t>(length_header_[0]) << 24) |
            (static_cast<size_t>(length_header_[1]) << 16) |
            (static_cast<size_t>(length_header_[2]) << 8) |
            static_cast<size_t>(length_header_[3]);
        buffered_ = 0;
        if (expected_bytes_ == 0) {
          length_bytes_ = 0;
          if (!received_flush_record_) {
            received_flush_record_ = true;
            Serial.println("[CameraStream] Bridge-Flush-Record empfangen");
          }
          continue;
        }
        if (expected_bytes_ > kMaxJpegBytes) {
          Serial.printf(
              "[CameraStream] JPEG-Frame zu gross: %u > %u Bytes\n",
              static_cast<unsigned>(expected_bytes_),
              static_cast<unsigned>(kMaxJpegBytes));
          set_status(camera_text().camera_input_buffer_full, true);
          failed_ = true;
          break;
        }
      }

      const size_t take =
          std::min(len, expected_bytes_ - buffered_);
      memcpy(input_ + buffered_, data, take);
      buffered_ += take;
      data += take;
      len -= take;
      if (buffered_ < expected_bytes_) continue;

      if (!received_first_frame_) {
        received_first_frame_ = true;
        Serial.printf(
            "[CameraStream] Erster vollstaendiger JPEG-Frame: %u Bytes "
            "int=%uKB largest=%uKB psram=%uKB\n",
            static_cast<unsigned>(expected_bytes_),
            static_cast<unsigned>(
                heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U),
            static_cast<unsigned>(
                heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL) /
                1024U),
            static_cast<unsigned>(
                heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U));
      }

      const uint32_t frames_before = g_worker_frame_count;
      if (!decode_jpeg_frame(input_, expected_bytes_)) {
        failed_ = true;
        break;
      }
      frame_count_ += g_worker_frame_count - frames_before;
      length_bytes_ = 0;
      expected_bytes_ = 0;
      buffered_ = 0;

      const uint32_t now = millis();
      if (now - last_fps_ms_ >= 2000) {
        const float fps =
            static_cast<float>(frame_count_) * 1000.0f /
            static_cast<float>(now - last_fps_ms_);
        Serial.printf("[CameraStream] Decode: %.1f FPS\n", fps);
        frame_count_ = 0;
        last_fps_ms_ = now;
      }
      taskYIELD();
    }
    return failed_ ? 0 : accepted;
  }

  int available() override { return 0; }
  int read() override { return -1; }
  int peek() override { return -1; }
  void flush() override {}

 private:
  uint8_t* input_;
  uint8_t length_header_[4] = {};
  size_t length_bytes_ = 0;
  size_t expected_bytes_ = 0;
  size_t buffered_ = 0;
  uint32_t frame_count_ = 0;
  uint32_t last_fps_ms_ = 0;
  bool received_flush_record_ = false;
  bool received_first_frame_ = false;
  bool failed_ = false;
};

class HttpChunkedBodyDecoder {
 public:
  bool feed(const uint8_t* raw, size_t len, JpegRecordStream& output) {
    size_t offset = 0;
    while (offset < len && state_ != State::Done) {
      switch (state_) {
        case State::SizeLine: {
          const char ch = static_cast<char>(raw[offset++]);
          if (ch == '\n') {
            if (!parse_size_line()) return fail("ungueltige Chunk-Groesse");
            size_line_len_ = 0;
            state_ = chunk_remaining_ == 0 ? State::Done : State::Data;
          } else if (ch != '\r') {
            if (size_line_len_ + 1 >= sizeof(size_line_)) {
              return fail("Chunk-Groessenzeile zu lang");
            }
            size_line_[size_line_len_++] = ch;
          }
          break;
        }
        case State::Data: {
          const size_t take =
              std::min(chunk_remaining_, len - offset);
          if (output.write(raw + offset, take) != take) return false;
          offset += take;
          chunk_remaining_ -= take;
          if (chunk_remaining_ == 0) state_ = State::DataCr;
          break;
        }
        case State::DataCr:
          if (raw[offset++] != '\r') {
            return fail("CR nach Chunk fehlt");
          }
          state_ = State::DataLf;
          break;
        case State::DataLf:
          if (raw[offset++] != '\n') {
            return fail("LF nach Chunk fehlt");
          }
          state_ = State::SizeLine;
          break;
        case State::Done:
          break;
      }
    }
    return state_ != State::Done;
  }

 private:
  enum class State : uint8_t {
    SizeLine,
    Data,
    DataCr,
    DataLf,
    Done,
  };

  bool parse_size_line() {
    size_t index = 0;
    while (index < size_line_len_ &&
           (size_line_[index] == ' ' || size_line_[index] == '\t')) {
      ++index;
    }
    uint32_t value = 0;
    bool have_digit = false;
    for (; index < size_line_len_; ++index) {
      const char ch = size_line_[index];
      if (ch == ';' || ch == ' ' || ch == '\t') break;
      uint8_t digit = 0;
      if (ch >= '0' && ch <= '9') {
        digit = static_cast<uint8_t>(ch - '0');
      } else if (ch >= 'a' && ch <= 'f') {
        digit = static_cast<uint8_t>(ch - 'a' + 10);
      } else if (ch >= 'A' && ch <= 'F') {
        digit = static_cast<uint8_t>(ch - 'A' + 10);
      } else {
        return false;
      }
      if (value > (UINT32_MAX - digit) / 16U) return false;
      value = value * 16U + digit;
      have_digit = true;
    }
    if (!have_digit) return false;
    chunk_remaining_ = value;
    return true;
  }

  bool fail(const char* reason) {
    Serial.printf("[CameraStream] HTTP-Chunk-Fehler: %s\n", reason);
    set_status(camera_text().camera_connection_ended, true);
    state_ = State::Done;
    return false;
  }

