GalusPeres/ESP32-P4-HomeAssistant-Display/src/video/camera_stream.cpp
  // Direct PPA bypasses LVGL, but LVGL can still repaint the popup after a
  // Bridge/UI update. Point it at this exact presented frame without scheduling
  // another expensive image redraw. The buffer then stays Displayed/protected
  // until the next successful presentation, so an incidental LVGL repaint can
  // never copy pieces of the old first frame over the live camera picture.
  if (ready >= 0 && direct_preview) {
    set_image_source_without_redraw(image, &g_images[ready]);
  }

  if (ready >= 0) {
    portENTER_CRITICAL(&g_state_mux);
    if (drop_failed_direct_frame) {
      g_frame_states[ready] = FrameState::Free;
    } else {
      if (g_displayed_index >= 0 &&
          g_displayed_index < static_cast<int8_t>(kFrameBufferCount) &&
          g_frame_states[g_displayed_index] == FrameState::Displayed) {
        g_frame_states[g_displayed_index] = FrameState::Free;
      }
      g_frame_states[ready] = FrameState::Displayed;
      g_displayed_index = ready;
    }
    portEXIT_CRITICAL(&g_state_mux);
  }

  if (ready >= 0 && !direct_preview && !drop_failed_direct_frame) {
    // Establish the first cache-coherent LVGL image. Do not force
    // lv_refr_now() here: a synchronous refresh blocked the UI for 130-150 ms.
    lv_image_set_src(image, &g_images[ready]);
    lv_obj_clear_flag(image, LV_OBJ_FLAG_HIDDEN);
    if (placeholder) lv_obj_add_flag(placeholder, LV_OBJ_FLAG_HIDDEN);
  } else if (direct_preview) {
    lv_obj_clear_flag(image, LV_OBJ_FLAG_HIDDEN);
    if (placeholder) lv_obj_add_flag(placeholder, LV_OBJ_FLAG_HIDDEN);
  }
  if (ready >= 0 && !drop_failed_direct_frame) note_presented_frame();

  char status[sizeof(g_status)] = "";
  bool status_error = false;
  bool status_changed = false;
  portENTER_CRITICAL(&g_state_mux);
  if (g_status_sequence != g_ui_status_sequence) {
    snprintf(status, sizeof(status), "%s", g_status);
    status_error = g_status_error;
    g_ui_status_sequence = g_status_sequence;
    status_changed = true;
  }
  portEXIT_CRITICAL(&g_state_mux);
  if (status_changed && status_label) {
    lv_label_set_text(status_label, status);
    lv_obj_set_style_text_color(
        status_label,
        status_error ? lv_color_hex(0xFF6B6B) : lv_color_hex(0xD8DEE9), 0);
  }
}

void camera_stream_set_external_status(const char* text, bool error) {
  set_status(text, error);
}

bool camera_stream_is_active() {
  return task_is_active();
}

#else

bool camera_stream_start(const char*, uint32_t) {
  camera_stream_set_external_status(
      i18n::strings(configManager.getConfig().language).camera_device_only,
      true);
  return false;
}

void camera_stream_stop() {}
void camera_stream_process_ui(lv_obj_t*, lv_obj_t*, lv_obj_t*) {}
void camera_stream_set_external_status(const char*, bool) {}
bool camera_stream_is_active() { return false; }

#endif
